#ifndef BASE_H_
#define BASE_H_

//////////////////////////////
// Feature detection macros

#if !defined(HAVE_ANDROID)
#if defined(__ANDROID__)
#define HAVE_ANDROID 1
#else
#define HAVE_ANDROID 0
#endif
#endif

#if !defined(HAVE_ARM)
#if defined(__arm__)
#define HAVE_ARM_32 1
#else
#define HAVE_ARM_32 0
#endif
#endif

#if !defined(HAVE_ARM_64)
#if defined(__aarch64__)
#define HAVE_ARM_64 1
#else
#define HAVE_ARM_64 0
#endif
#endif

#if !defined(HAVE_X86_32)
#if defined(__i386__) || (defined(_WIN32) && !defined(_WIN64))
#define HAVE_X86_32 1
#else
#define HAVE_X86_32 0
#endif
#endif

#if !defined(HAVE_X86_64)
#if defined(__x86_64__) || defined(_WIN64) || defined(_M_AMD64) || \
        defined(_M_X64) || defined(__amd64)
#define HAVE_X86_64 1
#else
#define HAVE_X86_64 0
#endif
#endif

#if !defined(HAVE_WINDOWS)
#if defined(_WIN32)
#define HAVE_WINDOWS 1
#else
#define HAVE_WINDOWS 0
#endif
#endif

#if !defined(_WIN32) && (defined(__unix__) || defined(__unix) || \
                         (defined(__APPLE__) && defined(__MACH__)))
#define HAVE_UNIX 1
#else
#define HAVE_UNIX 0
#endif

#if !defined(HAVE_LINUX)
#if defined(__linux__)
#define HAVE_LINUX 1
#else
#define HAVE_LINUX 0
#endif
#endif

#if !defined(HAVE_DEBUG)
#if defined(DEBUG) || defined(_DEBUG) || !defined(NDEBUG)
#define HAVE_DEBUG 1
#else
#define HAVE_DEBUG 0
#endif
#endif

#if !defined(HAVE_C99)
#if __STDC_VERSION__ >= 199901L
#define HAVE_C99 1
#else
#define HAVE_C99 0
#endif
#endif

#if !defined(HAVE_C11)

#ifndef HAVE_STB_IMAGE
#if __has_include(<stb_image.h>)
#define HAVE_STB_IMAGE 1
#else
#define HAVE_STB_IMAGE 0
#endif
#endif

#ifndef HAVE_VULKAN
#if __has_include(<vulkan/vulkan.h>)
#define HAVE_VULKAN 1
#else
#define HAVE_VULKAN 0
#endif
#endif

#if HAVE_GCC || HAVE_CLANG
typedef __builtin_va_list va_list;
#define va_start(ap, last) __builtin_va_start(ap, last)
#define va_end(ap) __builtin_va_end(ap)
#define va_arg(ap, type) __builtin_va_arg(ap, type)
#define va_copy(dest, src) __builtin_va_copy(dest, src)
#else
#include <stdarg.h>
#endif

//////////////////////////////
// Type definitions

#define F32_MAX 3.402823466e+38f
#define F32_MIN 1.175494351e-38f

#define F64_MAX 1.7976931348623158e+308
#define F64_MIN 2.2250738585072014e-308

#define I8_MAX 127
#define I8_MIN (-128)

#define I16_MAX 32767
#define I16_MIN (-32768)

#define I32_MAX 2147483647
#define I32_MIN (-2147483648)

#define I64_MAX 9223372036854775807ll
#define I64_MIN (-9223372036854775808ll)

#define U8_MAX 255
#define U8_MIN 0

#define U16_MAX 65535
#define U16_MIN 0

#define U32_MAX 4294967295u
#define U32_MIN 0

#define U64_MAX 18446744073709551615ull
#define U64_MIN 0

#if HAVE_ARM_64 || HAVE_X86_64
#define USIZE_MAX U64_MAX
#define USIZE_MIN U64_MIN
#define ISIZE_MAX I64_MAX
#define ISIZE_MIN I64_MIN
#elif HAVE_ARM_32 || HAVE_X86_32
#define USIZE_MAX U32_MAX
#define USIZE_MIN U32_MIN
#define ISIZE_MAX I32_MAX
#define ISIZE_MIN I32_MIN
#endif

#define F32_EPSILON 1.19209e-07f
#define F64_EPSILON 2.22045e-16

#define F32_PI 3.14159265358979323846f
#define F64_PI 3.14159265358979323846

#if HAVE_CPP || __STDC_VERSION__ >= 199901L
#include <stdbool.h>
typedef bool b8;
#else
#define true 1
#define false 0
typedef unsigned char b8;
#endif

typedef int b32;

typedef float f32;
typedef double f64;

typedef signed char i8;
typedef signed short i16;
typedef signed int i32;
#if HAVE_WINDOWS
typedef signed long long i64;
#elif HAVE_ANDROID
typedef signed long long i64;
#else
typedef signed long i64;
#endif

typedef unsigned char u8;
typedef unsigned short u16;
typedef unsigned int u32;

#if HAVE_WINDOWS || HAVE_ANDROID
typedef unsigned long long u64;
#else
typedef unsigned long u64;
#endif

#if HAVE_ARM_64
typedef unsigned long usize;
#elif HAVE_ARM_32
typedef unsigned int usize;
#elif HAVE_X86_64
#if HAVE_ANDROID
typedef unsigned long usize;
#else
typedef u64 usize;
#endif
#elif HAVE_X86_32
typedef u32 usize;
#else
#error "Unsupported architecture"
#endif

#if HAVE_ARM_64
typedef signed long isize;
#elif HAVE_ARM_32
typedef signed int isize;
#elif HAVE_X86_64
typedef i64 isize;
#elif HAVE_X86_32
typedef i32 ISize;
#else
#error "Unsupported architecture"
#endif

#if HAVE_X86_64 || HAVE_ARM_64
typedef u64 uptr;
typedef i64 iptr;
#elif HAVE_X86_32 || HAVE_ARM_32
typedef u32 uptr;
typedef i32 iptr;
#else
#error "Unsupported architecture"
#endif

// Properly define static assertions.
#define STATIC_ASSERT(cond, msg) \
        typedef char static_assertion__##msg[(cond) ? 1 : -1]

STATIC_ASSERT(sizeof(u8) == 1, expected_u8_to_be_1_byte);
STATIC_ASSERT(sizeof(u16) == 2, expected_u16_to_be_2_bytes);
STATIC_ASSERT(sizeof(u32) == 4, expected_u32_to_be_4_bytes);
STATIC_ASSERT(sizeof(u64) == 8, expected_u64_to_be_8_bytes);
STATIC_ASSERT(sizeof(i8) == 1, expected_i8_to_be_1_byte);
STATIC_ASSERT(sizeof(i16) == 2, expected_I16_to_be_2_bytes);
STATIC_ASSERT(sizeof(i32) == 4, expected_I32_to_be_4_bytes);
STATIC_ASSERT(sizeof(i64) == 8, expected_I64_to_be_8_bytes);
STATIC_ASSERT(sizeof(f32) == 4, expected_F32_to_be_4_bytes);
STATIC_ASSERT(sizeof(f64) == 8, expected_F64_to_be_8_bytes);

//////////////////////////////
// Printf format macros

#if HAVE_WINDOWS || HAVE_ANDROID
#define PRIuz "llu"
#define PRIiz "lli"
#define PRIu64 "llu"
#define PRIi64 "lli"
#else
#define PRIuz "lu"
#define PRIiz "li"
#define PRIu64 "lu"
#define PRIi64 "li"
#endif

//////////////////////////////
// Safe casting macros

#if HAVE_DEBUG
#define F64_TO_F32(x)                                                \
        ((x) >= (f64) - F32_MAX && (x) <= (f64)F32_MAX ?             \
                 (f32)(x) :                                          \
                 (fail_func(__FILE_NAME__, __LINE__, __func__,       \
                            "Value " #x " is out of range for f32"), \
                  0.0f))

#define I32_TO_U32(x)                                                      \
        ((x) >= 0 ? (u32)(x) :                                             \
                    (fail_func(__FILE_NAME__, __LINE__, __func__,          \
